farm_guide = 'Основная идея эффективного фарма артефактов заключается в фарме данжей где оба сета артефактов являются' \
             ' наиболее универсальными. Каждый пятизвездочный/четырехзвездочный артефакт следует просматривать и ' \
             'ставить "замочки" на те в которых есть нужный основной стат и, тем более, те в которых есть нужный ' \
             'основной стат и хотя-бы один доп стат'

slang = '''Роли:
    Основной ДД - Персонаж, которой наносит основной урон в отряде
    Саппорт - Персонаж, который как-либо усиливает/поддерживает других персонажей в отряде, либо лечит их
    Сап ДД - Второй ДД команды, обычно это такой персонаж, который может наносить урон не находясь на поле боя
    Хиллер - персонаж лечащий команду

Карманный персонаж - Такой персонаж, который может давать пользу отряду, не находясь на поле боя
Бафф - Усиление
Холд атака - заряженная атака
Ульта - взрыв стихий
Пачка - по-другому отряд
Куски/части чего-либо - артефакты из определенного сета
Сигна/сигнатурное оружие - оружие которое идеально подходит на персонажа, обычно добавляется в игру с выходом нового персонажа для него же
МС - Мастерство стихий
НР - здоровье(heal point)
КД - откат чего-либо. Ультавать по КД означает нажимать ульт сразу после отката
С1/С2/... - Означает кол-во созвездий на персонаже
Резист - сопротивление перснажа/моба к какому-либо типу урона. Срезать резисты означает понижать сопротивление
'''

scheme = '''Оружие:
    1. 
    2. 
    3. 
    
Сеты артефактов:
    1. 
    2. 
    3. 
    
Статы в артефактах:
    Доп статы:
        1. МС
        2. Восстановление энергии
        3. Крит урон/крит шанс
        4. Сила атаки %
        
Приоритет прокачки талантов:
    
    
Роль и примеры отрядов
    Роль: 
    
    Примеры отрядов:
        
        
Ресурсы для прокачки:'''

zhongli = '''Оружие:
    1. Посох Хомы. Лучший вариант, но скорее всего, если это оружие есть на акаунте, пойдет какому-то другому персонажу. Позволяет сделать гибридную сборку, так как увеличивает HP, дает кучу крит урона и силы атаки
    2. Копье Фавония. Отличный вариант для саппортской сборки, желательно иметь как минимум 3 пробуждения, закачивает много энергии, и позволяет чаще нажимать ульт, держа врагов в окаменении
    3. Черная кисть. Дает очень много HP, кроме этого ничего полезного нет, но если хочешь собрать Чжун Ли в максимально толстые щиты, то ставь это оружие
    PS. При желании сделать сборку в ДД, можно поставить любую дамажную пушку(Нефритовый коршун, Кромсатель пиков, Усмиритель бед и т.д.)

Сеты Артефактов:
    1. Стойкость Миллелита. Повышает здоровье и дает усиления для всего отряда, иногда может быть сложно сохранять бафф постоянно без первого созвездия, поэтому не самый удобный вариант
    2. Архаичный камень. Хороший вариант, дает неплохой бафф к урону основному ДД и легко активируется
    3. Можно поставить солянку 2/2 с любыми статовыми артефактами

Статы в артефактах:
    При сборке в максимально плотный щит, все ставим на HP
    При сборке в сапп ДД:
        Корона - крит шанс/крит урон
        Кубок - гео урон
        Часы - HP%
        Доп статы:
            1. HP%
            2. Крит шанс/Крит урон

Приоритет прокачки талантов:
   Навык->Ульта->Авто атака

Роль и примеры отрядов
   Роль: Чжун Ли универсальный саппорт щитовик, его можно поставить практически в любой отряд

Примеры отрядов: 
   Ху Тао, Син Цю, Сахароза, Чжун Ли

   Гань Юй, Сян Лин, Беннет, Чжун Ли

Ресурсы для прокачки:'''

kazuha = '''Оружие:
    1. Клятва свободы. Сигнатурное оружие, даёт много мастерства стихий, хорошая база и сильная пасивка
    2. Стальное жало. Дает МС, неплохая пасивка. Является достаточно дешёвым и доступным вариантом
    3. Церемониальный меч. Позволяет ультовать по КД за счет восстановления энергии в доп стате и пассивки. Лучше раскрывает себя с пробуждениями
    Доп место(для детей миллиардеров или для тех кто продал почку). Свет лиственного разреза. Лучший вариант, если в наличии имеется С6 Кадзуха.
    
Сеты артефактов:
    1. Изумрудная тень. Баффает анемо урон и урон рассеивания Кадзухе плюс режет резисты, что существенно баффает команду
    2. Позолоченные сны. Просто дает МС
    3. 2/2 солянка со статовыми артефактамииз следующих сетов: Изумрудная тень, Позолоченые сны, Странствующий ансамбль
    
Статы в артефактах:
    Есть два варианта как собрать Кадзуху, один через МС, другой стандартная ДД сборка, я советую собирать первое, но ниже опишу обе
    1. Сборка в мс
        Корона, кубок и часы на МС
    2. Сборка в ДД
        Корона - Крит шанс/крит урон
        Кубок - бонус анемо урона
        Часы - МС
    Доп статы:
        1. МС
        2. Восстановление энергии
        3. Крит урон/крит шанс
        4. Сила атаки %
        
Приоритет прокачки талантов:
    Навык->Ульта->Авто атака
    
Роль и примеры отрядов
    Роль: Кадзуха универсальный персонаж, которого можно поставить почти в любой отряд, хорошо показывает себя против групп мелких врагов
    
    Примеры отрядов:
        Гань Юй, Мона, Диона, Кадзуха
        Кадзуха, Сян Лин, Беннет, Син Цю
        Аяка, Кадзуха, Син Цю/Кокоми/Елань, Беннет/Шэнь Хэ
        
Ресурсы для прокачки:'''

raiden = '''Оружие:
    1. Сияющая жатва. Сигна. Большая база, много восстановления энергии в доп стате, сильная пасивка
    2. Улов. Лучшее оружие, если нет сигны. Неплохая база, даёт восстанову, и баффает ульту с пассивки. Желательно пятое пробуждение
    3. Небесная ось. Огромная база, восстановление энергии в под стате и довольно хорошая пассивка делают это оружие вторым по силе вариантом, но достать гараздо сложнее улова, который на пятом пробуждении идет на равных небесной осью
    
Сеты артефактов:
    1. Эмблема рассечённой судьбы. Единственный вариант, из-за слишком сильной пассивки за 4 куска, можно поставить любые другие статовые артефакты, пока нет хороших частей эмблемы
    
Статы в артефактах:
    Доп статы:
        1. Восстановление энергии
        2. Крит урон/крит шанс
        3. Сила атаки %
        4. МС
        
Приоритет прокачки талантов:
       Ульта->Навык->Авто атака
    
Роль и примеры отрядов
    Роль: Райден может выступать как основным ДД, так и сап ДД. Закачивает много энергии всей команде и себе, что позволяет нажимать кнопки по КД 
    
    Примеры отрядов:
        Райден, Беннет, Сян Лин, Син Цю
        Нахида, Райден, Фишль/Яэ Мико/Сара/Лиза, Яо Яо/Коллеи
        Райден, Сара, Беннет, Кадзуха/Венти/Сахароза
        
Ресурсы для прокачки:'''

ayaka = '''Оружие:
    1. Рассекающий туман. Сигна. Огромная база, много крит урона в доп стате, сильнейшая пасивка, не оружие, а сказка
    2. Харан гэппаку Фуцу/Небесный меч. Два довольно хороших варианта, нужные доп статы и сильные универсальные пассивки
    3. Кагоцурубэ Иссин/Амэнома Кагэути. Два четырехзвездочных меча, которые неплохо встанут на Аяку, за счет полезных пассивок, довольно легки в получении
    4. Черный меч. Пожалуй лучший четырехзвездочных меч на Аяку, но из-за того, что может быть получен только донатом, он на четвертом месте
    
Сеты артефактов:
    1. Заблудший в метели. Позволяет играть через заморозку, что является наиболее удобным стилем игры за Аяку, а также дает возможность не собирать слишком много крит шанса
    2. Любая 2/2 солянка с статовыми артами(гладиатор, метель, симэнава)
    
Статы в артефактах:
    Доп статы:
        1. Крит урон
        2. Сила атаки %
        3. Восстановление энергии
        4. Крит шанс
        
Приоритет прокачки талантов:
    Ульта->Авто атака->навык
    
Роль и примеры отрядов
    Роль: Основной ДД
    
    Примеры отрядов:
        Аяка, Шэнь Хэ, Кокоми, Беннет/Чжун Ли
        Аяка, Елань, Кадзуха/Венти/Сахароза, Беннет/Чжун Ли

Ресурсы для прокачки:'''

hutao = '''Оружие:
    1. Посох Хомы. Сигна. Большая база, куча крит урона с доп стата. Бафает НР и урон от макс НР с пассивки, и ко всему этому дополнительно баффает урон от НР, если его меньше 50%. Имба
    2. Нефритовый коршун. Достаточно сильная пушка скрит шансом и универсальной пассивкой
    3. Гроза драконов. Лучшее четырехзвездочное оружие, при игре через реацию пар, так как дает мастерство и увеличивает урон пассивкой
    4. Смертельный бой/Черногорская пика. Два неплохих, но труднодоступных варианта, к тому же уступают третьему месту, но если нет Грозы драконов или она стоит на другом персонаже, то можно поставить
    5. Прототип звездный блеск. Достаточно слабое оружие, но если нет вообще ничего другого, то можно поставить
    
Сеты артефактов:
    1. Горящая алая ведьма. Лучший вариант, все пассивки нужные и подходят под механики Ху Тао
    2. Воспоминания Симэнавы. Также хороший вариант, не сильно уступает Пиро сету, к тому же более приятен в фарме, если есть сильные куски то ставим его
    3. 2/2 статовая солянка со следующими артефактами: Горящая алая ведьма, Воспоминания Симэнавы, Гладиатор, Ансамбль/Позолоченные сны
    
Статы в артефактах:
    Корона - крит шанс/крит урон
    Кубок - бонус пиро урона
    Часы - НР%
    Доп статы:
        1. Крит урон/крит шанс
        2. НР%(Оптимальное кол-во НР около 30 000)
        3. МС(Довольно полезный стат на Ху Тао, не советую собирать больше 200 МС, оптимально около 100-150)
        4. Сила атаки %
        
Приоритет прокачки талантов:
    Навык и Авто атака равномерно, ульта по желанию(Имеет смысл короновать все три таланта)
    
Роль и примеры отрядов
    Роль: Ху Тао основной ДД, играющийся через заряженные атаки. Самый удобный стиль игры - это игра через реакцию пар
    
    Примеры отрядов:
        Ху Тао, Син Цю/Елань/Мона, Кадзуха/Сахароза/Венти, Чжун Ли/Диона/Ноэлль
        
Ресурсы для прокачки:'''

ganyu = '''Оружие:
    1. Лук Амоса. Сигна. Большая база на оружии + большая база у самой Гань Юй позволяют собрать большое итоговое значение силы атаки. Хорошая пассивка, но бафф за длительность полета стрелы активируется не самым удобным образом
    2. Небесное крыло. Огромная база, крит шанс в доп стате и сила атаки с пассивки делают это оружие отличным вариантом
    3. Аква Симулякрум. Не очень большая база, но из-за большого кол-ва крит урона в доп стате и неплохой пассивки стоит на третьем месте
    4. Любой другой пятизвездочный лук на урон неплохо подойдут на Гань Юй
    5. Прототип Полумесяц. Лучший четырехзвездочный лук, легок в получении. Не приятная для активации пассивка. Требуется пятое пробуждение для максимальной эффективности
    6. Хамаюми/Черногорский боевой лук. Хорошие четырехзвездочные луки, уступают прототипу, но если больше ничего нет, имеет место быть

Сеты артефактов:
    1. Странствующий ансамбль. Увеличивает урон заряженых атак и МС, позволяет играть через реакцию пар.
    2. Заблудший в метели. Баффает крио урон, требует игры от заморозки, для того чтобы получить бафф за 4 куска.
    3. Воспоминания Симэнавы. С этим сетом можно полностью забить на ульту и вообще её не нажимать, существенно баффая свою заряженную атаку
    4. Статовая 2/2 солянка со следующими артами: Симэнава, Гладиатор, Метель
    
Статы в артефактах:
    При сборке с Странствующим ансамблем/Воспоминаниями Симэнавы:
        Корона - шанс крита/крит урон
        Кубок - бонус крио урона
        Часы - сила атаки
    Доп статы:
        1. Крит шанс/ крит урон
        2. Сила атаки %
        3. МС
    При сборке с Заблудшим в метели:
        Корона - крит урон
        Кубок - бонус крио урона
        Часы - сила атаки
    Доп статы:
        1. Крит урон
        2. Сила атаки %
        3. Крит шанс(больше 30% нет смысла)
        4. Восстановление энергии
        
Приоритет прокачки талантов:
    Авто атаку коронуем, навык и ульта по желанию
    
Роль и примеры отрядов
    Роль: Основной ДД, играющий от холд атак
    
    Примеры отрядов:
        Гань Юй, Шэнь Хэ, Кокоми/Елань/Син Цю, Кадзуха/Венти/Сахароза/Чжун Ли/Ноэлль/Диона
        Гань Юй, Мона, Венти, Диона("Моргана")
        Гань Юй, Сян Лин, Беннет, Чжун Ли/Тома/Диона
        
Ресурсы для прокачки:'''

xiangling = '''Оружие:
    1. Сияющая жатва. "Бро, этот прицел просто имба" ©S1mple
    2. Небеная ось. Большая база, восстановление энергии в доп стате и полезная пассивка делают своё дело.
    3. Улов. Восстановление энергии в доп стате и универсальная сильная пассивка ставят это оружие на третье место. Каждое пробуждение напрямую усиливает ульту персонажа
    4. Гроза драконов. Небольшая база и довольно бесполезный МС в доп стате, но максимально полезная пассивка, поэтому это оружие на четвертом месте
    P.S. Можно поставить любую дамажную пушку

Сеты артефактов:
    1. Эмблема рассечённой судьбы. Сет с сильными баффами для Сян Лин, позволяет чаще ультавать и сильно баффает урон ульты
    2. Церемония древней знати. Можно поставить, если в отряде нет другого персонажа с этим сетом. Баффнет как Сянку так и команду
    3. Горящая алая ведьма. Сет хорошо баффнет урон, но не слишко полезен для команды, поэтому не советую его ставить

Статы в артефактах:
    Корона - Шанс крита/крит урон
    Кубок - Бонус пиро урона
    Часы - Восстановление энергии/сила атаки %
    Доп статы:
        1. Восстановление энергии
        2. Крит урон/крит шанс
        3. Сила атаки %

Приоритет прокачки талантов:
    Ульт->Навык->Авто атака

Роль и примеры отрядов
    Роль: Сян Лин сап ДД, который поддерживает пиро статус на враге и позволяет закрывать по нему реакции

    Примеры отрядов:
        Тарталья/Гань Юй, Сян Лин, Кадзуха/Венти/Сахароза, Беннет/Чжун Ли/Ноэлль
        Сян Лин, Син Цю/Елань/Кокоми, Беннет, Кадзуха/Венти/Сахароза

Ресурсы для прокачки:'''

xiao = '''Оружие:
    1. Нефритовй коршун. Сигна. Большая база, немного крит шанса в доп стате и неплохая универсальная пассивка
    2. Посох Хомы. Проигрывает сигне из-за более низкой базы плюс придется постоянно держать Сяо с пол НР или ниже, для постоянного баффа с пасивки
    3. Небесная Ось. База как у коршуна, полезное для Сяо восстановление энергии в доп стате, шанс крита с пасивки.
    4. Смертельный бой/Черногорская пика. Два лучших четырехзвездочных ствола, сложны в получении, как и любое другое оружие на Сяо
    5. Прототип Звездный блеск. Не очень хороший вариант, но если нет ничего другого, то ставим.

Сеты артефактов:
    1. Киноварное загробье. Сигнатурный сет для Сяо, пассивка направлена под механики Сяо, так что проблем с их активацией не будет
    2. 2/2 статовая солянка: Симэнава, Гладиатор, Изумрудная тень, Киноварное загробье, Отголоски подношения

Статы в артефактах:
    Корона - Шанс крита/крит урон
    Кубок - Бонус анемо урона
    Часы - Сила атаки %
    Доп статы:
        1. Крит урон/крит шанс
        2. Сила атаки %
        3. Восстановление энергии

Приоритет прокачки талантов:
    Улта и авто атака равномерно, навык по желанию

Роль и примеры отрядов
    Роль: Сяо основной ДД, от реакций не играется, так как имеет нейтральный элемент

    Примеры отрядов:
        Сяо зайдет в пачку с любыми саппортами и сап ДД, которым не требуется присутствовать на поле боя, для комфортной инры крайне рекомендуется поставить в пачку Щит, желательно Чжун Ли. Пример: 
        Сяо, Беннет, Кадзуха/Венти/Сахароза/Фарузан, Чжун Ли

Ресурсы для прокачки:'''

bennett = '''Оружие:
    1. Меч Сокола/Рассекающий туман. Оба варианты топовые из-за самой большой базы в игре. Второй вариант сильнее, но скорее всего будет ставиться на другого персонажа.
    2. Любая другая пушка с большой базой: Небесый меч, Кагоцурубэ Иссин, Прототип Злоба(Лучший четыреззвездочный) 

Сеты артефактов:
    1. Церемония древней знати. Баффает Урон с ульты Беннету и команде, ставим если в пачке нет другого персонажа с эти сетом
    2. Инструктор(да-да). Закачивает кучу мастерства всей команде, вариант имеет место быть
    3. Эмблема рассечённой судьбы/Горящая алая ведьма. Ставим эти сеты, если нужно что-бы беннет много дамажил

Статы в артефактах:
    Если нужно больше хила:
        Корона - бонус лечения
        Кубок - НР
        Часы - НР
    Если нужно больше урона:
        Корона - Крит шанс/крит урон
        Кубок - бонус пиро урона
        Часы - Сила атаки %/НР %/Восстановление энергии
    Доп статы:
        1. Шанс крита/крит урон
        2. Восстановление энергии
        3. НР
        4. Сила атаки %
        P.S. Места для доп статов условные, важность зависит от твоих целей и сборки

Приоритет прокачки талантов:
    Ульту максим, остальное по-желанию

Роль и примеры отрядов
    Роль: Беннет саппорт и сап ДД/хиллер, который очень сильно баффает команду на силу атаки из "кармана", заходит в ЛЮБУЮ пачку, кроме тех где НЕ нужен хил:

    Примеры отрядов:
        Аяка, Шэнь Хэ, Кокоми/Елань/Син Цю, Беннет
        Гань Юй, Сян Лин, Беннет, Чжун Ли

Ресурсы для прокачки:'''

text_guides_dict = {'Чжун Ли⏳': zhongli, 'Кадзуха🌪': kazuha, 'Райден⚡': raiden,
                    'Аяка❄': ayaka, 'Ху Тао👻': hutao, 'Гань Юй🏹': ganyu,
                    'Беннет🔥': bennett, 'Сян Лин🥩': xiangling, 'Сяо👹': xiao}

character_resources = {'Чжун Ли⏳': 'https://yvid.ru/wp-content/uploads/2020/12/Vozvyshenie-Chzhun-Li.jpg',
                       'Кадзуха🌪': 'https://avatars.dzeninfra.ru/get-zen_doc/3964212/pub_60bb3'
                                   '2a5bbd5974178426208_60db6c63e09a980274445814/scale_1200',
                       'Райден⚡': 'https://yvid.ru/wp-content/uploads/2020/12/Vozvyshenie-Segun-Rajden.jpg',
                       'Аяка❄': 'https://avatars.dzeninfra.ru/get-zen_doc/108399/pub_60f1942d'
                                   'cf9db26ddaa80079_60f890cb0c14cd3ca97173a6/scale_1200',
                       'Ху Тао👻': 'https://genshin.ru/wp-content/uploads/2023/02/prokachka_hu_tao.jpg',
                       'Гань Юй🏹': 'https://avatars.dzeninfra.ru/get-zen_doc/4935831/pub_5ffcbcf5aeef3c7829ff1'
                                   'd1f_60deced3526c5a7dabffa516/scale_1200',
                       'Беннет🔥': 'https://genshindb.ru/wp-content/uploads/2021/04/bennet-res.jpg',
                       'Сян Лин🥩': 'https://avatars.dzeninfra.ru/get-zen_doc/168601/pub_6001eb08d0d4386c9fd167c0_6130a'
                                   'e03ef7362581490eef2/scale_1200',
                       'Сяо👹': 'https://genshinhelper.ru/wp-content/uploads/2021/07/%D0%9C%D0%B0%D1%82%D0%B5%D1%8'
                                   '0%D0%B8%D0%B0%D0%BB%D1%8B-%D0%B4%D0%BB%D1%8F-%D0%B2%D0%BE%D0%B7%D0%B2%D1%8B%D1%'
                                   '88%D0%B5%D0%BD%D0%B8%D1%8F-%D1%81%D1%8F%D0%BE.jpg'}

video_guides = {'Гайд на фарм артефактов': 'https://www.youtube.com/watch?v=ghbFFpQ_-XI',
                'Чжун Ли⏳': 'часть 1: https://www.youtube.com/watch?v=725ikw9karY \n'
                            'часть 2: https://www.youtube.com/watch?v=vbIqtzt-wk8',
                'Кадзуха🌪': 'https://www.youtube.com/watch?v=HSgp20-AuyM',
                'Райден⚡': 'гайд на персонажа: https://www.youtube.com/watch?v=LF0LiiNBcWk \n'
                           'гайд на Raiden National: https://www.youtube.com/watch?v=oLkyhzdfENU',
                'Аяка❄': 'https://www.youtube.com/watch?v=FBGEOw3NGOQ',
                'Ху Тао👻': 'https://www.youtube.com/watch?v=X2mJItYYFEI',
                'Гань Юй🏹': 'https://www.youtube.com/watch?v=I_fFvrjyjJw',
                'Беннет🔥': 'https://www.youtube.com/watch?v=AvfHFcz4vUo',
                'Сян Лин🥩': 'https://www.youtube.com/watch?v=9k5v1ZfVewU',
                'Сяо👹': 'гайд: https://www.youtube.com/watch?v=U_ow8r_vuzs&t=2s \n'
                        'дополнение: https://www.youtube.com/watch?v=s7KunA5UbMg'}
