zhongli = '''Оружие:
    1. Посох Хомы. Лучший вариант, но скорее всего, если это оружие есть на акаунте, пойдет какому-то другому персонажу. Позволяет сделать гибридную сборку, так как увеличивает HP, дает кучу крит урона и силы атаки
    2. Копье Фавония. Отличный вариант для саппортской сборки, желательно иметь как минимум 3 пробуждения, закачивает много энергии, и позволяет чаще нажимать ульт, держа врагов в окаменении
    3. Черная кисть. Дает очень много HP, кроме этого ничего полезного нет, но если хочешь собрать Чжун Ли в максимально толстые щиты, то ставьте это оружие
    PS. При желании сделать сборку в ДД, можно поставить любую дамажную пушку(Нефритовый коршун, Кромсатель пиков, Усмиритель бед и т.д.)

Сеты Артефактов:
    1. Стойкость Миллелита. Повышает здоровье и дает усиления для всего отряда, иногда может быть сложно сохранять бафф постоянно без первого созвездия, поэтому не самый удобный вариант
    2. Архаичный камень. Хороший вариант, дает неплохой бафф к урону основному ДД и легко активируется
    3. Можно поставить солянку 2/2 с любыми статовыми артефактами

Статы в артефактах:
    При сборке в максимально плотный щит, все ставим на HP
    При сборке в сапп ДД:
        Корона-крит шанс/крит урон
        Кубок-гео урон
        Часы-HP%
        Доп статы:
            1. HP%
            2. Крит шанс/Крит урон

Приоритет прокачки талантов:
   Навык->Ульта->Авто атака

Роль и примеры отрядов
   Роль: Чжун Ли универсальный щитовик, его можно поставить практически в любой отряд

Примеры отрядов: 
   Ху Тао, Син Цю, Сахароза, Чжун Ли

   Гань Юй, Сян Лин, Беннет, Чжун Ли

Ресурсы для прокачки:'''


